{
  "recommendedEpisodes": [
    {
      "author": "Bob Saget & Studio71",
      "podcastTitle": "Bob Saget's Here For You",
      "episodeTitle": "Bob Saget's Here For You - Official Trailer",
      "description": "BOB SAGET’S HERE FOR YOU is a podcast that is like no other— Because it goes inside Bob’s Saget’s mind, and then quickly filters out through his mouth. Bob has a way of calming people with genuine empathy and humor while they’re going through a difficult time, which we all are at present. Reaching his unusually diverse audience that he talks to as a friend, Bob is the dad with great advice, the irreverent funny guy who’s always there when you need a laugh, and the free-associative Bob who goes off on crazy tangents then returns to the subject at hand, as serious or as comedic as it may be, to wrap up each episode in a way only Bob can do. Because he really does believe, “He’s here for you. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "episodeId": "https://chtbl.com/track/8E527/https://dts.podtrac.com/redirect.mp3/traffic.megaphone.fm/STU2169580300.mp3?updated=1584662510",
      "audioFeedURL": "https://chtbl.com/track/8E527/https://dts.podtrac.com/redirect.mp3/traffic.megaphone.fm/STU2169580300.mp3?updated=1584662510",
      "datePublished": "Fri, 17 Apr 2020 07:00:00 -0000",
      "duration": "0:01:21.000000",
      "showImageURL": "https://images.megaphone.fm/8a51iyVYVIRKkmZinM2nZphIhF2Y5EjmCaInUcWts4s/plain/s3://megaphone-prod/podcasts/53657338-6a3b-11ea-82a1-1374b968110f/image/uploads_2F1587409693598-sc718g05yp-f38c7fa0d7a78f86788429615462fc17_2FStatic%2B3000x3000.png",
      "showId": "id1504319251",
      "showDescription": "BOB SAGET’S HERE FOR YOU is a podcast that is like no other— Because it goes inside Bob Saget’s mind, and then quickly filters out through his mouth. Bob has a way of calming people with genuine empathy and humor while they’re going through a difficult time, which we all are at present. Reaching his unusually diverse audience that he talks to as a friend, Bob is the dad with great advice, the irreverent funny guy who’s always there when you need a laugh, and the free-associative Bob who goes off on crazy tangents then returns to the subject at hand, as serious or as comedic as it may be, to wrap up each episode in a way only Bob can do. Because he really does believe, “He’s here for you. To leave a message for Bob call (562) 600-0343. For advertising opportunities please email PodcastPartnerships@Studio71us.com. We wanna make the podcast even better, help us learn how we can: https://bit.ly/2EcYbu4",
      "subject": "Comedy"
    },
    {
      "author": "Jessimae Peluso",
      "podcastTitle": "Sharp Tongue",
      "episodeTitle": "Which Psychedelic Should You Try? | Jackee Stang ",
      "description": " Welcome to Psychedelic Sundays on the Sharp Tongue Podcast. We welcome, marijiuana and psychedelic aficionado, Jackee Stang to the podcast to discuss the first time she tried acid, how psychedelics are evolving in culture, and which psychedelic you should try first.Check out our NEW Patreon page! Pick any tier to receive exclusive content! Patreon page link:&nbsp;https://found.ee/JessimaePeluso-PatreonThanks to my wonderful sponsors at Absolute Xtracts for keeping me sane during the quarantine! For all things Jackee:www.RealitySandwich.comFor submissions to be considered for publications email: Info@RealitySandwich.com ",
      "episodeId": "https://rss.art19.com/episodes/f555ad66-2c57-4c60-80ab-b89b00584819.mp3",
      "audioFeedURL": "https://rss.art19.com/episodes/f555ad66-2c57-4c60-80ab-b89b00584819.mp3",
      "datePublished": "Sun, 22 Mar 2020 22:25:42 -0000",
      "duration": "0:58:54.000000",
      "showImageURL": "https://content.production.cdn.art19.com/images/8c/14/1f/6e/8c141f6e-d811-4c93-a1df-6efe6b8ed79b/fd82e91144302b3c349daa3cbb145cd5326ef8e39b36b3131cab3c6eef62b755d3014f6f9c8520e801fe28ead8b5b5de688ed3967be970327b3fcc7c8821a394.jpeg",
      "showId": "id983093988",
      "showDescription": " Stand up comedian, Jessimae Peluso, holds nothing back in this hilariously fun and sometimes heartbreakingly candid podcast about comedy, sex, loss, and an eternal pursuit for the funny. It will feel like a conversation with that friend who always keeps it real.*Each week is something NEW featuring comedians, Dr. Peluso advice, movie companions, and more! Join our NEW Patreon club to get exclusive podcast videos and episodes:&nbsp;https://found.ee/JessimaePeluso-Patreon ",
      "subject": "Comedy"
    },
    {
      "author": "Juanique and Tristin Roney",
      "podcastTitle": "Gutsy Health | Nutrition and Medicine",
      "episodeTitle": "Cannabidiol (CBD) | The Softer Side of Weed",
      "description": "In this episode of Gutsy Health, we talk about CBD. Most people know this as the weed oil. At first, we were a little hesitant to consider it as a healing method, but the research behind the benefits was so solid that we decided to try it and we are so glad we did. We tell our story behind CBD, our personal results from using it, and the science of how CBD can help. We also recognize that there are a lot of politics behind distributing, selling, and buying CBD. This episode exposes the corruption preventing CBD use. Lastly, we talk about who CBD is for and what dosage you should take.Our Experience with CBD 0:15What is CBD/Science behind it 7:07Good vs Bad CBD 25:21Politics of CBD 44:40Dosage 54:39“Another thing that brings up, that has been really impressive to us about CBD, is that it does not seem to have an upper limit. Like we have seen people take astronomical amounts of this stuff, but the worst side effects they get are that they are like super chill.” 22:35www.mygutsyhealth.comhttps://www.instagram.com/gutsy_mom/@provohealth@gutsy_momSupport the show (https://www.mygutsyhealth.com/gutsy-family)",
      "episodeId": "https://www.buzzsprout.com/1230431/4643810-cannabidiol-cbd-the-softer-side-of-weed.mp3?blob_id=18349127",
      "audioFeedURL": "https://www.buzzsprout.com/1230431/4643810-cannabidiol-cbd-the-softer-side-of-weed.mp3?blob_id=18349127",
      "datePublished": "Tue, 14 Jan 2020 04:00:21 -0700",
      "duration": "1:08:39.000000",
      "showImageURL": "https://storage.buzzsprout.com/variants/p7o1sgfj0ber3dxyjkagg5nl9f5o/8d66eb17bb7d02ca4856ab443a78f2148cafbb129f58a3c81282007c6fe24ff2.jpg",
      "showId": "id1474697743",
      "showDescription": "In the Gutsy Health podcast, Tristin and Juanique Roney cover the topics involved in alternative health, holistic health, nutrition, diets, and medicine. They have transformed their own lives and their patient's lives by researching the best health practices and translating them into an applicable lifestyle. Their goal is to share their knowledge and help empower individuals in taking their health back into their own hands and living a better, healthier life.",
      "subject": "Health"
    },
    {
      "author": "Karen Martel: expert in women's hormone health and weight loss.",
      "podcastTitle": "The Other Side of Weight Loss",
      "episodeTitle": "How to Bring Soul Into Life with Thomas Moore",
      "description": "In this episode, I explore with best selling author Thomas Moore what the soul has to do with relationships. How the soul expresses itself in our many relationships with our partners, family, friends, and children. What is the soul and soul mates? How as a society we need to bring more soul into our conversations and even into the bedroom. http://thomasmooresoul.com/ Watch the video on our Women's Empowerment Project YouTube channel. Join the OnTrack women's weight loss and hormone balancing master class.  In the OnTrack Program, You Find Out Exactly What is Keeping You From Losing Weight, Balance Your Hormones and Feel Amazing! Karen Martel, Certified Transformational Nutrition Coach and weight loss expert.  Visit https://karenmartel.com/  Karen's Facebook Karen's Instagram Join the OnTrack Women's Weight Loss program",
      "episodeId": "https://traffic.libsyn.com/secure/karenmartel/podcast_thomas_moore.mp3?dest-id=815799",
      "audioFeedURL": "https://traffic.libsyn.com/secure/karenmartel/podcast_thomas_moore.mp3?dest-id=815799",
      "datePublished": "Wed, 24 Apr 2019 22:50:11 +0000",
      "duration": "0:50:00.000000",
      "showImageURL": "https://ssl-static.libsyn.com/p/assets/0/b/4/7/0b47f9f48a9b56f1/podcast_cover_art_4.png",
      "showId": "id1438772276",
      "showDescription": "Do you want to know the TRUTH about what it really takes to lose weight? If the answers YES then TUNE in and get ready to talk about the Other Side of Weight Loss! This podcast is for women who are ready to go beyond diet and exercise and want to discover what is REALLY stopping them from losing weight and feeling their best! Karen Martel Transformational Nutrition Coach, weight loss and hormone expert covers all things women's health including nutrition, weight loss, hormone health, digestion, happiness, stress management and living in tune with your body!",
      "subject": "Health"
    },
    {
      "author": "20 Minute Fitness",
      "podcastTitle": "20 Minute Fitness",
      "episodeTitle": "Health & Fitness Fact Of The Day: CBD - 20 Minute Fitness Episode #146",
      "description": "CBD or&nbsp;cannabidiol is one of the active ingredients of marijuana. However, unlike&nbsp;marijuana, this ingredient in itself won't give you that feeling of high. Instead, it is becoming increasingly popular for other benefits, such as the reduction of anxiety and depression. Learn more about the uses and benefits of CBD now!",
      "episodeId": "https://backtracks.fm/shape/pr/4967b08e-40bb-11ea-b6f3-0ec8c96eda55/20-minute-fitness---episode-146.mp3?s=1&sd=1&u=1580098572",
      "audioFeedURL": "https://backtracks.fm/shape/pr/4967b08e-40bb-11ea-b6f3-0ec8c96eda55/20-minute-fitness---episode-146.mp3?s=1&sd=1&u=1580098572",
      "datePublished": "Mon, 27 Jan 2020 11:00:00 +0000",
      "duration": "0:05:44.000000",
      "showImageURL": "https://feeds.backtracks.fm/feeds/series/2ae6b488-b648-11e8-b740-0e79905dbac6/images/main.jpg?1598486559320",
      "showId": "id1303951242",
      "showDescription": "20 Minute Fitness dives into the science and technology of today's fitness world for you. Packing need-to-know info about the latest in fitness nutrition, tech, science, and methodology every Thursday. Stay up to date with the current fitness news and trends without taking up all your time. Find out more at 20minute.fitness.",
      "subject": "Health"
    },
    {
      "author": "Stuart Ralph",
      "podcastTitle": "The OCD Stories",
      "episodeTitle": "Bob Burg On How You Can Succeed Despite OCD",
      "description": "Show notes: Bob’s OCD story (2:20) The types of therapy/medication Bob has done (7:30) Bob’s advice on Exposure and Response Prevention therapy (ERP) (9:30) Bob’s advice on therapy (11:40) OCD Stigma (13:10) Bob’s advice for business people with OCD (16:30) How to get motivated in an OCD spike. Action precedes motivation (19:40) Bob’s morning routine (22:18) OCD and exercise (24:25) What OCD has taught Bob (25:40) Being happy despite OCD (30:30) Success mindset vs fixed minset for recovery. The importance of personal development (31:30) Bob’s one key piece of business advice (34:25) Bob’s additional advice on dealing with OCD (36:00) What Bob would want written on a billboard (37:00) Find out more about Bob: Website: http://www.burg.com Twitter: http://www.twitter.com/bobburg Resources: The Go-Giver by Bob Burg IOCDF.org - International OCD Foundation ACT book mentioned in the episode: The Acceptance Field Guide Bob's OCD story in written format >> To your success, Stuart and The OCD Stories team Get exclusive podcasts and content by becoming a member of the podcast find out more here >>",
      "episodeId": "https://traffic.libsyn.com/secure/theocdstories/Best_selling_author_Bob_Burg_shares_his_OCD_story.mp3?dest-id=331182",
      "audioFeedURL": "https://traffic.libsyn.com/secure/theocdstories/Best_selling_author_Bob_Burg_shares_his_OCD_story.mp3?dest-id=331182",
      "datePublished": "Sat, 19 Dec 2015 23:52:35 +0000",
      "duration": "0:38:16.000000",
      "showImageURL": "https://ssl-static.libsyn.com/p/assets/b/e/b/c/bebce93c96ab31db/Podcast_logo.png",
      "showId": "id1065492988",
      "showDescription": "Welcome to The OCD Stories podcast. The OCD Stories is a show that offers hope and inspiration. I interview some of the best minds in OCD treatment and recovery to share their advice, to both entertain and educate listeners towards a healthier life. Hope it helps. Disclaimer - this podcast is not a replacement for therapy. Please seek treatment from a licensed mental health professional.",

      "subject": "Health"
    },
    {
      "author": "Pam Barnhill",
      "podcastTitle": "Your Morning Basket",
      "episodeTitle": "YMB #21 Why Shakespeare? A Conversation with Ken Ludwig",
      "description": "Shakespeare. Whatever feelings you have about the Bard, we can all agree that he was the most influential English writer in history. But why should I bother with Shakespearean language for my littles in Morning Time? Won't there be plenty of time for that when they are older? More importantly how would I introduce such a daunting mass of literature? What if I don't know much Shakespeare myself? What if I don't even think I like Shakespeare? Ken Ludwig is a playwright and father who has an infectious love of Shakespeare. He began sharing his love with his children at a very young age. Recently he published How to Teach Your Children Shakespeare, a book detailing this surprisingly simple way to teach the Bard's great works to our children. Come and enjoy as Ken tells us why and how we should teach Shakespeare, as well as how we can handle the harder concepts. Most importantly, Ken encourages us to push past our fear and enjoy Shakespeare in our Morning Times.",
      "episodeId": "https://www.buzzsprout.com/1228148/4626884-ymb-21-why-shakespeare-a-conversation-with-ken-ludwig.mp3?blob_id=18273041",
      "audioFeedURL": "https://www.buzzsprout.com/1228148/4626884-ymb-21-why-shakespeare-a-conversation-with-ken-ludwig.mp3?blob_id=18273041",
      "datePublished": "Tue, 20 Sep 2016 01:30:00 -0400",
      "duration": "0:43:13.000000",
      "showImageURL": "https://storage.buzzsprout.com/variants/2yw3v6chg6ij23te0araxhr1njn9/f81607a3cd537406cf0cf506c726bfe2824c5e584c9e9dc5e04e42436c820a79.jpg",
      "showId": "id1030232536",
      "showDescription": "Join us as we delve into the principles and practices of homeschool Morning Time aka Morning Basket or Circle Time. With both experts in their fields and mentor-moms, we will discuss everything from how to choose the right books for a wide age range, to how to memorize a poem, to how to get the kids to sit still. All your burning Morning Time questions answered right here -- every other Tuesday.",
      "subject": "English Literature"
    },
    {
      "author": "Liz Cottrill, Emily Kiser and Nicole Williams",
      "podcastTitle": "A Delectable Education Charlotte Mason Podcast",
      "episodeTitle": "Episode 38: Shakespeare",
      "description": " In this week's podcast, we discuss why Shakespeare was always included in Charlotte Mason's curriculum. What is the value of Shakespeare as part of the study of literature, and how can we who have little experience with his works enter in and enjoy his feast? Listen Now: If you are seeing this message, please make sure you are using the most current version of your web browser: Internet Explorer 9, Firefox, Chrome Just as we partake of that banquet which is 'Shakespeare' according to our own needs and desires, so do the children behave at the ample board set before them; there is enough to satisfy the keenest intelligence while the dullest child is sustained through his own willing effort. (Vol. 6, p. 245) We probably read Shakespeare in the first place for his stories, afterwards for his characters, the multitude of delightful persons with whom he makes us so intimate that afterwards, in fiction or in fact, we say, 'She is another Jessica,' and 'That dear girl is a Miranda'; 'She is a Cordelia to her father,' and, such a figure in history, 'a base lago.' To become intimate with Shakespeare in this way is a great enrichment of mind and instruction of conscience. Then, by degrees, as we go on reading this world-teacher, lines of insight and beauty take possession of us, and unconsciously mould our judgments of men and things and of the great issues of life. (Vol. 4, p. 72) This is what Shakespeare, as great a philosopher as a poet, set himself to teach us, line upon line, precept upon precept. His 'Leontes,' 'Othello,' 'Lear,' 'Prospero,' 'Brutus,' preach on the one text––that a man's reason brings certain infallible proofs of any notions he has wilfully chosen to take up. There is no escape for us, no short cut; art is long, especially the art of living. (Vol. 6, pp. 314-15) And Shakespeare? He, indeed, is not to be classed, and timed, and treated as one amongst others,––he, who might well be the daily bread of the intellectual life; Shakespeare is not to be studied in a year; he is to be read continuously throughout life, from ten years old and onwards. But a child of ten cannot understand Shakespeare. No; but can a man of fifty? Is not our great poet rather an ample feast of which every one takes according to his needs, and leaves what he has no stomach for? (Vol. 5, p. 224) Something Wicked This Way Comes, Ray Bradbury The Winter of Our Discontent, John Steinbeck Brave New World, Aldous Huxley Roller Skates, Ruth Sawyer The Wonderful Winter, Marchette Chute Tales from Shakespeare, Charles and Mary Lamb Beautiful Stories from Shakespeare, E. Nesbit (Contains affiliate links) Interview with Nancy Kelly Chronological List of Shakespeare's Plays American Shakespeare Center ",
      "episodeId": "https://traffic.libsyn.com/secure/adelectableeducation/Episode38.mp3?dest-id=476249",
      "audioFeedURL": "https://traffic.libsyn.com/secure/adelectableeducation/Episode38.mp3?dest-id=476249",
      "datePublished": "Thu, 14 Jul 2016 08:54:33 +0000",
      "duration": "0:35:09.000000",
      "showImageURL": "https://ssl-static.libsyn.com/p/assets/7/a/e/a/7aeaebeeecbba2b9/ADEPodcastLogo.png",
      "showId": "id1043994904",
      "showDescription": "Through weekly conversations, three moms who have studied the Charlotte Mason method of education and put her ideas into practice in their homes join together to share with one another for the benefit of listeners by giving explanations of Mason's principles and examples of those principles put into practice out of their own teaching experience. These short discussions aim at providing information, support, and encouragement for others by unfolding the myriad aspects.",
      "subject": "English Literature"
    },
    {
      "author": "AJ Hoge",
      "podcastTitle": "Effortless English Podcast | Learn English with AJ Hoge",
      "episodeTitle": "Gandhi",
      "description": "Finding Truth.",
      "episodeId": "https://traffic.libsyn.com/secure/effortlessenglish/Gandhi.mp3?dest-id=17067",
      "audioFeedURL": "https://traffic.libsyn.com/secure/effortlessenglish/Gandhi.mp3?dest-id=17067",
      "datePublished": "Wed, 15 May 2019 19:46:25 +0000",
      "duration": "0:46:22.000000",
      "showImageURL": "https://ssl-static.libsyn.com/p/assets/1/5/1/1/1511cf5d4b850681/Podcast_Big.jpg",
      "showId": "id188333691",
      "showDescription": "Speak English powerfully using the Effortless English system. Learn English with AJ Hoge, The World's #1 English Teacher. Learn tips and strategies to improve your spoken English. Learn English vocabulary. Learn about American English and American culture. Be a successful English speaker and international leader!",
      "subject": "Education"
    },
    {
      "author": "Dictionary.com",
      "podcastTitle": "Dictionary.com's Word Of The Day Podcast",
      "episodeTitle": "Word Of The Day: April 23, 2020",
      "description": "It's April 23rd, also known as Shakespeare Day. Sometimes known as Talk Like Shakespeare Day. To that end, our Word of the Day is Shakespeare-themed, of course. ",
      "episodeId": "https://anchor.fm/s/12a4e1d0/podcast/play/12691219/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2020-3-20%2F66210408-44100-2-6dfc1a5b7d9bf.m4a",
      "audioFeedURL": "https://anchor.fm/s/12a4e1d0/podcast/play/12691219/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2020-3-20%2F66210408-44100-2-6dfc1a5b7d9bf.m4a",
      "datePublished": "Thu, 23 Apr 2020 07:00:00 GMT",
      "duration": "0:01:13.000000",
      "showImageURL": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/3027956/3027956-1582654511138-097b198333aa.jpg",
      "showId": "id1501533587",
      "showDescription": "Listen to this podcast to build your vocabulary with new words, definitions, and origin stories every day of the week.",
      "subject": "Education"
    },
    {
      "author": "Conspiracy Theories, Aliens, Paranormal, Demons, Occult, Bigfoot, Reptilians, Cryptozoology, Conspiracies, Supernatural, UFOs",
      "podcastTitle": "Theories of the Third Kind",
      "episodeTitle": "DMT and The Machine Elves",
      "description": "Upon taking DMT, the world&#8217;s most powerful psychedelic, individuals seem To Encounter Machine Elves and other Mysterious entities. Who/What Are [&#8230;] The post DMT and The Machine Elves appeared first on Theories of the Third Kind. ",
      "episodeId": "https://www.theoriesofthethirdkind.com/download-episode/748/dmt-and-the-machine-elves.mp3?ref=feed",
      "audioFeedURL": "https://www.theoriesofthethirdkind.com/download-episode/748/dmt-and-the-machine-elves.mp3?ref=feed",
      "datePublished": "Thu, 16 Apr 2020 20:30:19 +0000",
      "duration": "1:07:51.000000",
      "showImageURL": "https://www.theoriesofthethirdkind.com/wp-content/uploads/2019/06/Theories_of_the_third_kind.jpg",
      "showId": "id1466851347",
      "showDescription": "Explore the unknown with us. Conspiracy Theories, Aliens, Paranormal, Demons, Occult, Bigfoot, Reptilians, Cryptozoology, Conspiracies, Supernatural, UFOs. We seek the truth & provide the most interesting, thought-provoking questions & conspiracies. Dedicated to seeking the truth & waking the masses. https://www.TheoriesoftheThirdKind.com",
      "subject": "Comedy"
    },
    {
      "author": "iHeartRadio",
      "podcastTitle": "Next Question with Katie Couric",
      "episodeTitle": "Does CBD deserve the hype?",
      "description": "CBD is everywhere: You can buy CBD olive oil, CBD mascara, CBD supplements for your dog- even CBD tampons! Some swear it alleviates everything from insomnia to chronic pain, anxiety and depression. But is it everything it’s cracked up to be? Or is it just the latest fad? Katie weeds out CBD fact from fiction with a little help from Kristen Bell, a CBD devotee, Rob Rosenheck, co-founder of Hollywood’s favorite CBD brand, and Dr. Yasmin Hurd, the country’s leading CBD researcher. She even samples some CBD products—for science!—and shares her thoughts about the experience. Learn more about your ad-choices at https://news.iheart.com/podcast-advertisers",
      "episodeId": "https://www.podtrac.com/pts/redirect.mp3/chtbl.com/track/5899E/traffic.megaphone.fm/HSW7775029623.mp3?updated=1570681549",
      "audioFeedURL": "https://www.podtrac.com/pts/redirect.mp3/chtbl.com/track/5899E/traffic.megaphone.fm/HSW7775029623.mp3?updated=1570681549",
      "datePublished": "Thu, 10 Oct 2019 13:00:00 -0000",
      "duration": "0:27:19.000000",
      "showImageURL": "https://images.megaphone.fm/W1CaGTGVGr5VeSkezyBWbqEuiBDgixbONvWJKTOYfvc/plain/s3://megaphone-prod/podcasts/7429a1a2-70e5-11e9-bea3-7b031047fdb1/image/uploads_2F1569462946852-usny1kjwaf8-addd3887ac6b789f76307e83b3f62d05_2FNextQuestionWithKatieCouric-Logo-FINAL-3000x3000-iHR.png",
      "showId": "id1134154895",
      "showDescription": "Katie Couric has questions. And on her new show, Next Question with Katie Couric, she’s determined to find answers—with a little help from the most captivating personalities in news, politics, and pop culture. For example: How did watching people play video games become a billion-dollar industry? Could CBD possibly be the key to overcoming pain and addiction? Does social media spur online radicalization? And what happens when at-home DNA tests reveal devastating family secrets? Join the award-winning journalist as she explores the people, movements, and issues changing our lives and redefining our world.",
      "subject": "Talk Show"
    },
    {
      "author": "Krystal Proffitt",
      "podcastTitle": "The Proffitt Podcast",
      "episodeTitle": "BONUS EPISODE: Getting Soul Naked with Erin Call",
      "description": "What does it mean to be soul naked? It means stripping all of the junk out of your life and getting down to the nitty-gritty part of you. Figuring out your passions. Finding your desires. And uprooting those limiting beliefs that have been holding you back. If this is exactly what you need, then this is the interview for you.Today's guest, Erin Call, is a soul success and empowerment coach. She focuses on abundance over scarcity. Authenticity over fake. And stepping your game up to the next level!If you're looking to find that inner energetic self you know is buried down there somewhere, then this is the episode for you!",
      "episodeId": "https://chtbl.com/track/54138/www.buzzsprout.com/186317/1359676-bonus-episode-getting-soul-naked-with-erin-call.mp3?blob_id=3541978",
      "audioFeedURL": "https://chtbl.com/track/54138/www.buzzsprout.com/186317/1359676-bonus-episode-getting-soul-naked-with-erin-call.mp3?blob_id=3541978",
      "datePublished": "Thu, 04 Jul 2019 00:00:00 -0500",
      "duration": "0:50:46.000000",
      "showImageURL": "https://storage.buzzsprout.com/variants/xB3pKAfANVpke4oDYGETDzL1/f81607a3cd537406cf0cf506c726bfe2824c5e584c9e9dc5e04e42436c820a79?.jpg",
      "showId": "id1401950194",
      "showDescription": "Hi, I'm Krystal - your host of The Proffitt Podcast. Have you ever found yourself asking, What equipment do I need to start a podcast? What is the best way to launch? How can I get more downloads? What does it take to market a podcast? Then you're in the right place, my friend. Entrepreneurs dream of creating deeper connections with their audience, but they're totally overwhelmed with the thought of podcasting. On this podcast, I strip down the process and take all of the overwhelm away. With my 3-Step approach (Start, Launch, and Market), I deliver content to help you take action and create a podcast your audience craves. I've worked with online business owners wanting to have a better marketing strategy, just like you, to individuals not even sure what a podcast is. The motto around here is, We all have to start somewhere. Join us every Tuesday and Thursday for new episodes on how you can Start, Launch, and Market your own podcast.",
      "subject": "Well-being"
    },
    {
      "author": "Josh Trent",
      "podcastTitle": "Wellness Force",
      "episodeTitle": "326 John Chavez: How To Create DMT Naturally Inside Your Body",
      "description": "Endogenous DMT acts as an antioxidant and anti-inflammatory; so, producing these sorts of chemicals would seem to be optimal for the brain. There's enough evidence to show that endogenous DMT produced by proper breathwork creates more optimized fluid dynamics in the brain and thus allowing us to kind of clear out debris; not only when we sleep but also when we're awake too. - John Chavez   What is DMT and how can it help you stop being a slave to your own mind?   Get 15% off your CURED Nutrition order with the code WELLNESSFORCE   ---> Get The Morning 21 System: A simple and powerful 21 minute system designed to give you more energy to let go of old weight and live life well.   JOIN THE FACEBOOK GROUP | *REVIEW THE PODCAST* Wellness Force Radio Episode 326 Founder of DMT Quest, John Chavez, shares what endogenous DMT is and how we naturally produce it, his number one advice for tapping into our human possibilities, and how DMT research is solving the stress, anxiety, cancer, and chronic illness rising tide.   Discover how tuning into the mind, body, and soul through breathwork, sound, meditation, and other environments help us produce our own psychedelic state.    CURED Nutrition Get 15% off your CURED Nutrition order with the code WELLNESSFORCE It's taken me over a year to find the right hemp and CBD company to introduce to the Wellness Force Community and I could not be more thrilled that it's CURED Nutrition! CURED Nutrition is a movement inspired by nature and grounded in a shared desire to leave a lasting impression on you, our community, and this world. Together, they're a collective of heart-centered human beings who are inviting you – the conscious creatives, dreamers, and healers – to join their family. Learn how CURED hemp and CBD products can enhance your daily wellness routine. They're Colorado-based organically grown hemp products that have been engineered to transform your approach toward an elevated life. Tap into your inherent potential – your greatest mind-body alignment – and nourish it with the supplements you were designed to thrive on. A greater existence is waiting.   Listen To Episode 326 As John Chavez Uncovers:   [1:30]  Questions For The Lion Tamer John Chavez Questions For The Lion Tamer Part 1  Questions For The Lion Tamer part 2 DMT Quest 308 Dr. Edith Ubuntu Chan Cured Nutrition 300 Special Edition: Top Lessons Learned From 300+ Shows About his books, Questions For The Lion Tamer Parts 1 and 2, and why he named them with that particular title. Why we get so caught up in this 3D world as victims who have been imprinted on by society or even parents so we don't reach our full potential. The mystery of why some people expand into their potential and why some don't (8:30) 299 Christa Orecchio 249 Niraj Naik His path to becoming a healer including his own healing journey for better wellness. The strange mind-manifesting sensations he was experiencing and how it impacted those around him. How he was able to transfer his energy to another person with just a touch. Controlling our physiology through visualization, intent, and mindset.   [19:30]  His Spiritual Awakening: Nothing Is An Accident His religious upbringing and why he considered himself an atheist. The Alchemist by Paulo Coelho Why he believes he accidentally induced his spiritual awakening one day. The massive digestive issues he was experiencing and how he was able to heal himself. His poor lifestyle habits back then and what pushed him to finally start focus on living life well. (22:30) The work hard, play hard sickness that many people fall into before the real healing begins. His first introduction to DMT after a suggestion from his cousin. DMT: The Spirit Molecule by Rick Strassman Joe Rogan Podcast DMT: The Spirit Molecule (2010) Why DMT, found in the human body, is called The Spirit Molecule Rick Strassman's studies and how many people have explained DMT has this deep euphoria that they've never experienced before. The launch of research on endogenous DMT at the University of Michigan. (28:00) ‘Mystical’ Psychedelic Compound Found in Normal Brains   [29:00] DMT - The Spirit Molecule What makes DMT so unique; especially the kind we can create through breathwork, meditation, or flow states. Vipassana Meditation – A Spartan Race For The Mind Why plant medicine is not about drugs but achieving real awareness through an altered state of consciousness. (29:35) What endogenous DMT is and how it helps us stop being a slave to our own minds. Wim Hof The most recent facts from the latest DMT Endogenous studies. (32:15) Four diaphragms of the lungs and how deep breathing impacts the entire body. Why breathwork, besides music, is the quickest way to get to an altered state of consciousness. The power of DMT as an antioxidant and anti-inflammatory as it produces optimal chemicals for the brain. 305 Anthony DiClementi   [35:30] Psychedelics vs Meditation & Breathwork The differences between psychedelics (Ayahuasca) and natural practices such as meditation and breathwork. Rythmia The term he uses, '“endohuasca ' and what it can teach us about our natural ability to create these endogenous states. Why it's more important than ever before to support endohuasca research to help people on their wellness journeys. 196 Aubrey Marcus 275 Paul Chek The fact that love is the key to everything and he feels it in his heart and knows it in his brain. (41:30) Nick McLaughlin of Stationary Astronaut Gabor Mate Terence McKenna PlantMedicine.org Plant Medicine Podcast 247 Dr. Lynn Marie Morski   [43:00] Tools & Practices For Releasing DMT Naturally What tools or practices you can use on a daily basis to start releasing this natural, endogenous DMT. The fact that we are designed to breathe through the nose, not the mouth. 290 Dan Brulé Why it's not about the length of the meditation but the depth of the meditation that makes a great impact on our wellness. What developments he would like to see moving forward in the research and understanding of endogenous DMT. 241 Dr. Dan Engle 325 Dr. Josh Flowers & Dr. Dan Engle Revive Treatment Centers of America What he suspects we would find if everyone jumped on board and began to incorporate breathwork into their lives.   [50:00] Spreading Knowledge Of Our Human Potential Alan Watts 199 Peter Crone What is coming next for John on his journey of practical spirituality. (52:00) Dr. Joe Dispenza Exploring the concept that the beliefs, thoughts, and feelings we experience aren't actually ours. (54:40) 311 Mark Wolynn How he would describe what 'source' is to someone who has a very analytical mind. 073 Kute Blackson M21 Wellness Guide Wellness Force Community     The Creation of Endogenous DMT Through Breath When endogenous DMT, which is naturally produced within the human brain, is upregulated, it also induces neuroplastic properties which allow us to change our neural pathways that then allows us to change our perception and perception is everything. It changes our way of thinking, changes our perception, and changes our life. Anything along the lines of natural tools such as breathwork, meditation, or sound that create endogenous DMT is always going to be in the right direction. - John Chavez         Cleansing The Brain Through Breathwork From what I've seen, the quickest way to get in an altered state is breathwork. It's faster than hypnosis or meditation. Deep breathing also correlates with the cleansing of the brain. It's like DMT acts as an antioxidant and anti-inflammatory; so, producing these sorts of chemicals would seem to be optimal for the brain. There's enough evidence to show that endogenous DMT produced by proper breathwork creates more optimized fluid dynamics in the brain and thus allowing us to kind of clear out debris; not only when we sleep but also when we're awake too. - John Chavez       Unpacking What 'Source' Is We have the idea that we're disconnected from everything but there is a source, something powering everything on this earth. 'Source' is like the Sun; without it, everything on this plant will die. Whether directly or indirectly, we need it because it's the driving foundation of life. - John Chavez     Links From Today's Show 308 Dr. Edith Ubuntu Chan Cured Nutrition 300 Special Edition: Top Lessons Learned From 300+ Shows 299 Christa Orecchio 249 Niraj Naik The Alchemist by Paulo Coelho DMT: The Spirit Molecule by Rick Strassman Joe Rogan Podcast DMT: The Spirit Molecule (2010) Rick Strassman ‘Mystical’ Psychedelic Compound Found in Normal Brains Vipassana Meditation – A Spartan Race For The Mind Wim Hof 305 Anthony DiClementi Rythmia 196 Aubrey Marcus 275 Paul Chek Nick McLaughlin of Stationary Astronaut Gabor Mate Terence McKenna PlantMedicine.org Plant Medicine Podcast 247 Dr. Lynn Marie Morski 290 Dan Brulé 241 Dr. Dan Engle 325 Dr. Josh Flowers & Dr. Dan Engle Revive Treatment Centers of America Alan Watts 199 Peter Crone Dr. Joe Dispenza 311 Mark Wolynn 073 Kute Blackson M21 Wellness Guide Wellness Force Community Questions For The Lion Tamer Part 1  Questions For The Lion Tamer part 2 John Chavez DMT Quest Facebook Twitter Instagram YouTube   About John Chavez John Chavez believes that communication of mystical and supernormal experiences is just as important as the scientific exploration of these occurrences. There needs to be a bridge between scientific results and the ability of the general public to understand these results in a straightforward manner. In this digital age of media, he believes that a widely distributed ongoing docuseries can provide a tool to accomplish this goal. After having operated as an independent researcher for 5 years and having written 2 books titled “Questions for the Lion Tamer: Delving into the Mystery that is DMT” and “Questions for the Lion Tamer 2: Swimming in Electric Endohuasca”, he believes that it is now time to take everything to the next level. DMT Research This entire field of research has been lagging tremendously since the 1970’s financially speaking. It is embarrassing that with an annual budget of over $39 billion dollars that the NIH still refuses to allocate any amount to endogenous DMT research. One would figure that if the NIH can spend $3.2 million studying the effects of alcohol in monkeys, it can surely spend the same amount on a field that the general public is extremely interested in such as endogenous DMT. In any case, it’s been estimated that there are nearly 2,500 billionaires in the world and likely over 50,000 hundred millionaires (people with $100,000,000 or more). There is enough private funding out there collecting dust that could change this endogenous DMT research industry in a very short time frame.     About DMT Quest DMT Quest is a 501c3 non-profit organization that is focused on raising money and awareness for endogenous DMT research. This organization operates under a strict 100% transparency code in which all fundraising generated by DMT Quest will be publicly disclosed on our website and any expenses/allocations will be publicly posted as well (in a straightforward manner). This company was created in order to solve the problem of a lack of funding for endogenous DMT research. While a psychedelic renaissance of sorts is taking place currently (2019) in which companies such as MAPS have raised upwards of nearly $50 million for exogenous psychedelic studies, the endogenous research capital has been minimal at best. Based on internet statistics, the general public appears extremely interested in the discussion and results of endogenous DMT studies. DMT Quest's Mission Our mission is to create a brand that can assist in driving research funds into this specific field in order to satisfy the demands of the public and develop a greater understanding of human biology and potential. We have culminated a powerful list of advisors including Wim Hof, Dr. Jimo Borjigin, Dr. Dennis Mckenna, Dr. Roland Griffiths, Dr. Ede Frecska, Dr. Edith Ubuntu Chan, Dr. David Luke, Dr. Mauro Zappaterra, Dr. Andrew Gallimore, Dr. Jason Wallach, Dr. Ovidiu Brazdau, and Dr. Robert Davis.   Join The #WellnessWarrior VIP Club **Click on the photo above to get exclusive discounts on new wellness tools, be first in line for new podcasts, get access to invite-only events, and so much more.**   More Top Episodes 226 Paul Chek: The Revolution Is Coming (3 Part Series) 131 Drew Manning: Emotional Fitness 129 Gretchen Rubin: The Four Tendencies  183 Dr. Kyra Bobinet: Brain Science 196 Aubrey Marcus: Own The Day 103 Robb Wolf: Wired To Eat Best of The Best: The Top 10 Guests From over 200 Shows Get More Wellness In Your Life Join the #WellnessWarrior Community on Facebook Tweet us on Twitter: Send us a tweet Comment on the Facebook page ",
      "episodeId": "https://traffic.libsyn.com/secure/wellnessforceradio/WFR-326.mp3?dest-id=250652",
      "audioFeedURL": "https://traffic.libsyn.com/secure/wellnessforceradio/WFR-326.mp3?dest-id=250652",
      "datePublished": "Tue, 18 Feb 2020 08:01:00 +0000",
      "duration": "1:02:04.000000",
      "showImageURL": "https://ssl-static.libsyn.com/p/assets/e/9/7/d/e97d1c200836d054/250KB_size.jpeg",
      "showId": "id1009470193",
      "showDescription": "Wellness Force is a global collective dedicated to mastering physical and emotional intelligence for humans to thrive in our modern world. In this podcast together, we walk the courage path to cross the gap between knowing and doing. Your Host Josh Trent asks the questions no one else will ask to get the truth about how to live a life of confidence, freedom, and optimal wellness. This is where your Hero's journey comes alive as you listen and live the (3) phases of true intelligence: Gathering, Applying, & Embodiment. Learn from world class leaders in the fields of Physical intelligence, breathwork, emotional intelligence, behavior change, wellness, nutrition, behavioral psychology, habits, mindset, fitness, health, strength training, organic supplementation, biohacking, body transformation, psychedelics, mindfulness, meditation, neuroscience, mental health, spirituality, consciousness and the 7 pillars of wellness to live life well.",
      "subject": "Health"
    }
  ]
}
